
let N = Number(prompt("Користувачу, введіть ціле число(N) від якого ми будемо складати."));

while (N % 1 !== 0 || N == "" || N <= 0) {
    N = Number(prompt("Користувачу, це число нам не підходить! Введіть інше ціле число(N) від якого ми будемо складати."));
}


let M = Number(prompt("Користувачу, введіть ціле число(М) до якого ми будемо складати."));
while (M % 1 !== 0 || M == "" || M <= N) {
    M = Number(prompt("Користувачу, це число нам не підходить! Введіть інше ціле число(M) до якого ми будемо складати."));
}

let trueOrFalse = confirm("Користувачу, вибери булевий параметр(true/false), який підкаже нам чи потрібно пропускати парні числа. (ОK)TRUE – потрібно, (Скасувати )FALSE – не потрібно.");
let sum = 0; 
 
for (let i = N; i <= M; i++) { 
  if (trueOrFalse) { 
    if (i % 2 !== 0) { 
      sum += i; 
    } 
  } else { 
    sum += i; 
  } 
  console.log(sum);
}

document.writeln(`<p>– сума чисел виведена на екрані буде === ${sum}</p>`)